print("""Вот твой первый вопрос:
Кто был первы президентом России?
1. Путин Владимир Владимирович
2. Ельцин Борис Николаевич
3. Медведев Дмитрий Анатольевич
4. Мишустин Михаил Владимирович""")
answer_one = int(input())
if answer_one == 2:
    print("Yes")
    print("""Второй вопрос:
Кто основатель компании Microsoft?
1. Ульям (Билл) Гейтс
2. Стив Джобс
3. Илон Маск
4. Марк Цукерберг""")
    answer_two = int(input())
    if answer_two == 1:
        print("Yes")
        print("""Третий вопрос:
Какую фамилию носил главный герой поэмы А. Твардовского?
1. Старцев
2. Швабрин
3. Тёркин
4. Толстой""")
        answer_three = int(input())
        if answer_three == 3:
            print("Yes")
            print("""Четвертый вопрос:
В песне какого барда есть строчка 'Лыжи у печки стоят...'?
1. Юрий Визбор
2. Вильям Блек
3. Александр Галич
4. Виктор Коморов""")
            answer_four = int(input())
            if answer_four == 1:
                print("Yes")
                print("""Пятый вопрос:
Какой советский космонавт получил первую космическую почту?
1. Гудвин Береговой
2. Юрий Батурин
3. Гречко Аркадий
4. Владимир Шаталов""")
                answer_five = int(input())
                if answer_five == 4:
                    print("Yes")
                    print(""" вопрос:
В песне какого барда есть строчка 'Лыжи у печки стоят...'?
1. Юрий Визбор
2. Вильям Блек
3. Александр Галич
4. Виктор Коморов""")
                    answer_six = int(input())
                    if answer_six == 1:
                        print("Yes")
                        print("""Пятый вопрос:
Какой советский космонавт получил первую космическую почту?
1. Гудвин Береговой
2. Юрий Батурин
3. Гречко Аркадий
4. Владимир Шаталов""")
                        answer_seven = int(input())
                        if answer_seven == 4:
                            print("Yes") 
                            print("""Пятый вопрос:
Какой советский космонавт получил первую космическую почту?
1. Гудвин Береговой
2. Юрий Батурин
3. Гречко Аркадий
4. Владимир Шаталов""")
                            answer_eight = int(input())
                            if answer_eight == 4:
                                print("Yes")
                                print("""Пятый вопрос:
Какой советский космонавт получил первую космическую почту?
1. Гудвин Береговой
2. Юрий Батурин
3. Гречко Аркадий
4. Владимир Шаталов""")
                                answer_nine = int(input())
                                if answer_nine == 4:
                                    print("Yes") 
                                    print("""Пятый вопрос:
Какой советский космонавт получил первую космическую почту?
1. Гудвин Береговой
2. Юрий Батурин
3. Гречко Аркадий
4. Владимир Шаталов""")
                                    answer_ten = int(input())
                                    if answer_ten == 4:
                                        print("Вы победили, выигрыш составил 1.000к")                                 
                                    else:
                                        print("Вы проиграли, Ваш выигрыш составил 700к")                                
                                else:
                                    print("Вы проиграли, Ваш выигрыш составил 700к")                            
                            else:
                                print("Вы проиграли, Ваш выигрыш составил 700к")                           
                        else:
                            print("Вы проиграли, Ваш выигрыш составил 300к")
                    else:
                        print("Вы проиграли, Ваш выигрыш составил 300к")
                else:
                    print("Вы проиграли, Ваш выигрыш составил 300к")
            else:
                print("Вы проиграли, Ваш выигрыш составил 300к")
        else:
            print("вы проиграли и ничего не выиграли")
    else:
        print("вы проиграли и ничего не выиграли")
else:
    print("вы проиграли и ничего не выиграли")
